# 1. Напишите код на python, который посчитает и
# выведет на экран количество единичек и их индексы в массиве:
#
# [-1,  1, -2, -1, -2,  0,  2, -3,  2, -2,  0, -1,  1, -3,  0,  1,  2, -1, -3, -3]
a = [-1,  1, -2, -1, -2,  0,  2, -3,  2, -2,  0, -1,  1, -3,  0,  1,  2, -1, -3, -3]
print(a)
count = 0
print('Индексы: ', end='')
for i in range(len(a)):
    if abs(a[i]) == 1:
        count +=1
        print(i,end=' ')
print('Общее количество единичек: ',count)